app/controllers/tasks_controller.rb

	def show
		@tasks = current_user.tasks

		if @tasks

			@tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" INNER JOIN "user_tasks" ON "tasks"."id" = "user_tasks"."task_id" WHERE "user_tasks"."user_id" = ?  [["user_id", 1]]